# === Base Docker ===
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers

# === GIT ===
mhutchie.git-graph

# === PHP ===
bmewburn.vscode-intelephense-client
xdebug.php-debug
neilbrayfield.php-docblocker

# === Symfony ===
TheNouillet.symfony-vscode

# === Twig ===
mblode.twig-language-2

# === Configuración (YAML, ENV, XML) ===
redhat.vscode-yaml
mikestead.dotenv
DotJoshJohnson.xml

# === Testing ===
recca0120.vscode-phpunit

# === Calidad de código ===
junstyle.php-cs-fixer
