# === Base Docker ===
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers

# === GIT ===
mhutchie.git-graph

# === Python Development ===
ms-python.python
ms-python.vscode-pylance
ms-python.debugpy

# === Python Tools ===
donjayamanne.python-extension-pack
donjayamanne.python-environment-manager
njpwerner.autodocstring
visualstudioexptteam.vscodeintellicode
kevinrose.vsc-python-indent
njqdev.vscode-python-typehint

# === Linting & Formatting ===
ms-python.black-formatter
ms-python.flake8
ms-python.isort
ms-python.mypy-type-checker
ms-python.pylint

# === Testing ===
littlefoxteam.vscode-python-test-adapter

# === TOML Support (pyproject.toml, poetry) ===
tamasfe.even-better-toml
bungcip.better-toml

# === Jupyter/Notebook Support ===
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers

# === Markdown (documentation) ===
yzhang.markdown-all-in-one

# === Utilities ===
editorconfig.editorconfig
gruntfuggly.todo-tree
streetsidesoftware.code-spell-checker
oderwat.indent-rainbow
