# === Base Docker ===
ms-azuretools.vscode-docker
ms-vscode-remote.remote-containers

# === GIT ===
eamodio.gitlens
mhutchie.git-graph

# === Shell/Bash ===
timonwong.shellcheck
rogalmic.bash-debug
foxundermoon.shell-format

# === YAML (docker-compose, configs) ===
redhat.vscode-yaml

# === Markdown (documentación) ===
yzhang.markdown-all-in-one
bierner.markdown-preview-github-styles

# === Utilidades ===
editorconfig.editorconfig
gruntfuggly.todo-tree
streetsidesoftware.code-spell-checker
